{
    "HOME": {
        "TITLE": "Olá, eu sou",
        "NAME": "Guilherme Fernandes Pavezzi",
        "DESCRIPTION": "Desenvolvedor de Software Full Stack, apaixonado por criar soluções web modernas e funcionais, sempre buscando aplicações eficientes e bem estruturadas."
    },
    "ABOUT": {
        "TITLE": "Sobre Mim",
        "DESCRIPTION": "Sou um desenvolvedor de software full stack com paixão por tecnologia e pela arte de criar soluções digitais. Estudo desenvolvimento de software desde 2020 e, desde então, venho aprimorando minhas habilidades em C#, Angular e outras tecnologias. Tenho experiência na criação e melhoria de APIs, microsserviços e interfaces web, sempre buscando aplicar boas práticas e entregar soluções funcionais. Estou em constante aprendizado e motivado por desafios que me permitam evoluir e contribuir para projetos inovadores."
    },
    "JOBS": {
        "TITLE": "Empresas Trabalhadas",
        "DESCRIPTION": "Atuei como Desenvolvedor Júnior na Dnaxis, na equipe responsável por sistemas tintométricos, com foco no desenvolvimento e manutenção de APIs e interfaces web. Contribuí ativamente na criação e correção de APIs em C# e ASP.NET MVC, implementando novas funcionalidades para atender às necessidades de clientes em novos projetos. Além disso, participei do desenvolvimento de interfaces com Angular, assegurando uma comunicação eficiente entre front-end e back-end. Trabalhei em um ambiente colaborativo, buscando sempre a melhoria contínua do código, aderência a boas práticas de desenvolvimento e entregas com qualidade e alinhadas aos prazos estabelecidos.",
        "DESCRIPTION2": "Atuei como Estagiário e, posteriormente, como Desenvolvedor Júnior na Online Applications, contribuindo para o desenvolvimento de soluções na área de EDI (Electronic Data Interchange), com foco no sistema da Azul Linhas Aéreas. Desenvolvi microsserviços em C#, participando de todo o fluxo de integração, desde o recebimento e processamento de notas fiscais — com leitura de arquivos nos formatos NOTFIS, JSON e XML — até o envio de arquivos EDI como OCOREN, CONEMB e DOCCOB para os parceiros comerciais da Azul. Também tive envolvimento na análise e correção de falhas, implementação de melhorias e na garantia da qualidade dos dados transmitidos entre os sistemas."
    },
    "PROJECTS": {
        "TITLE": "Projetos"
    },
    "MYPORTFOLIO": {
        "TITLE": "Meu Portfólio",
        "DESCRIPTION": "Site pessoal desenvolvido com Angular, TypeScript e Tailwind CSS, apresentando projetos, habilidades e experiências.",
        "BUTTON": "Ver no Github"
    },
    "IN_CONSTRUCTION":
    {
        "TITLE": "Em Construção",
        "DESCRIPTION": "Este projeto ainda está em desenvolvimento. 🚧"
    },
    "PASSIN": {
        "TITLE": "PassIn API",
        "DESCRIPTION": "Projeto desenvolvido no NLW para aprender sobre DDD e práticas de desenvolvimento de APIs com C# e ASP.NET Core.",
        "BUTTON": "Ver no Github"
    }
}